Repository: arukas/ClashTray
Catalog: src/ClashTray.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# TrayTooltipError
source: ClashTray · Needs attention
zh_cn: ClashTray · 需要注意

# TrayTooltipStopped
source: ClashTray · Disconnected
zh_cn: ClashTray · 已断开

# MenuOpenPanel
source: Open control panel
zh_cn: 打开控制面板

# MenuStartCore
source: Start core
zh_cn: 启动核心

# MenuRestartCore
source: Restart core
zh_cn: 重启核心

# MenuStopCore
source: Stop core
zh_cn: 停止核心

# MenuEnableSystemProxy
source: Turn on system proxy
zh_cn: 开启系统代理

# MenuDisableSystemProxy
source: Turn off system proxy
zh_cn: 关闭系统代理

# MenuRestoreSystemProxy
source: Restore system proxy
zh_cn: 恢复系统代理

# MenuEnableTun
source: Turn on TUN
zh_cn: 开启 TUN

# MenuDisableTun
source: Turn off TUN
zh_cn: 关闭 TUN

# MenuModeRule
source: Rule mode
zh_cn: 规则模式

# MenuModeGlobal
source: Global mode
zh_cn: 全局模式

# MenuModeDirect
source: Direct mode
zh_cn: 直连模式

# MenuQuit
source: Quit ClashTray
zh_cn: 退出 ClashTray

# ThemeTooltipAuto
source: Theme: Auto
zh_cn: 主题：自动

# ThemeTooltipLight
source: Theme: Light
zh_cn: 主题：浅色

# ThemeTooltipDark
source: Theme: Dark
zh_cn: 主题：深色

# ThemeTooltipNakhimov
source: Theme: Nakhimov
zh_cn: 主题：Nakhimov

# EasterEggMoreFormat
source: {0} more clicks…
zh_cn: 再点击 {0} 次…

# EasterEggVisitor
source: A special guest is waiting.
zh_cn: 有一位特别的访客。

# EasterEggWelcomeBack
source: Welcome back, Nakhimov
zh_cn: 欢迎回来，Nakhimov

# EasterEggUnlocked
source: Nakhimov unlocked
zh_cn: Nakhimov 已解锁

# EasterEggEnabledHint
source: The bonus theme is on; switch freely in the theme menu.
zh_cn: 彩蛋主题已启用，可在主题菜单中自由切换。

# EasterEggSaveFailedFormat
source: Failed to save the bonus theme: {0}
zh_cn: 彩蛋主题保存失败：{0}

# ThemeSwitchFailedFormat
source: Failed to switch theme: {0}
zh_cn: 主题切换失败：{0}

# EndpointManagementHeader.Text
source: Remote Mihomo endpoints
zh_cn: 远程 Mihomo 端点

# EndpointManagementHint.Text
source: Manage endpoint metadata here. Remote endpoints cannot control this computer's core, system proxy, or TUN; HTTPS uses Windows system trust by default.
zh_cn: 这里仅管理端点元数据。远程端点不会接管本机核心、系统代理或 TUN；HTTPS 默认使用 Windows 系统信任。

# EndpointListView.AutomationProperties.Name
source: Mihomo endpoint list
zh_cn: Mihomo 端点列表

# EndpointNameBox.Header
source: Display name
zh_cn: 显示名称

# EndpointUriBox.Header
source: Controller origin
zh_cn: Controller 根地址

# EndpointTransportBox.Header
source: Transport security
zh_cn: 传输安全

# EndpointHttpsSystemTrustItem.Content
source: HTTPS (Windows system trust)
zh_cn: HTTPS（Windows 系统信任）

# EndpointHttpExplicitItem.Content
source: HTTP (explicitly acknowledged risk)
zh_cn: HTTP（仅限已确认风险的端点）

# EndpointHttpRiskCheckBox.Content
source: I understand this endpoint uses cleartext HTTP and accept the risk
zh_cn: 我确认此端点使用明文 HTTP，且风险由我承担

# EndpointSecretBox.Header
source: Controller secret (optional)
zh_cn: Controller secret（可选）

# EndpointCustomCaBox.Header
source: Custom CA certificate (PEM, optional)
zh_cn: 自定义 CA 证书（PEM，可选）

# EndpointHttpsCustomItem.Content
source: HTTPS (custom CA)
zh_cn: HTTPS（自定义 CA）

# EndpointTrustHint.Text
source: The secret is protected with Windows DPAPI; a custom CA applies only to this endpoint. There is no “ignore HTTPS certificate errors” option, and the Windows global certificate store is not changed.
zh_cn: secret 使用 Windows DPAPI 保护；自定义 CA 只对当前端点生效。不会提供“忽略 HTTPS 证书错误”，也不会修改 Windows 全局证书库。

# SaveEndpointButton.Content
source: Save endpoint
zh_cn: 保存端点

# RemoveEndpointButton.Content
source: Remove endpoint
zh_cn: 删除端点

# EndpointFieldsRequired
source: Enter an endpoint name and Controller origin.
zh_cn: 请填写端点名称和 Controller 根地址。

# EndpointHttpRiskRequired
source: Explicitly acknowledge cleartext transport before using HTTP.
zh_cn: 使用 HTTP 前必须明确确认明文传输风险。

# EndpointCustomCaRequired
source: Paste a CA certificate when custom CA trust is selected.
zh_cn: 选择自定义 CA 时，请粘贴 CA 证书内容。

# EndpointCustomCaOnly
source: Enter a CA certificate only when HTTPS (custom CA) is selected.
zh_cn: 只有选择 HTTPS（自定义 CA）时才能填写 CA 证书。

# EndpointUriInvalid
source: The Controller origin must be a valid absolute HTTP(S) URI.
zh_cn: Controller 根地址必须是有效的绝对 HTTP(S) 地址。

# EndpointSaved
source: Endpoint metadata saved.
zh_cn: 端点元数据已保存。

# EndpointRemoved
source: The endpoint and unreferenced local credentials were removed.
zh_cn: 端点及不再使用的本地凭据已删除。

# EndpointNotFound
source: The endpoint no longer exists.
zh_cn: 端点已不存在。

# EndpointSelectRemote
source: Select a remote endpoint.
zh_cn: 请选择一个远程端点。

# EndpointTest
source: Test
zh_cn: 测试

# EndpointTesting
source: Testing…
zh_cn: 测试中…

# EndpointTestSucceeded
source: Read-only handshake succeeded: {0} (Mihomo {1}).
zh_cn: 只读握手成功：{0}（Mihomo {1}）。

# EndpointVersionUnknown
source: Unknown version
zh_cn: 未知版本

# EndpointConnect
source: Connect
zh_cn: 连接

# EndpointCurrent
source: Current
zh_cn: 当前

# EndpointReturnLocal
source: Use local
zh_cn: 切回本机

# EndpointSelected
source: Switched to {0}.
zh_cn: 已切换到 {0}。

# EndpointLocalSummary
source: Local Controller; cannot be removed
zh_cn: 本机 Controller；不可删除

# EndpointSecurityHttpsSystemTrust
source: HTTPS / system trust
zh_cn: HTTPS / 系统信任

# EndpointSecurityHttpsCustomCa
source: HTTPS / custom CA
zh_cn: HTTPS / 自定义 CA

# EndpointSecurityHttpConfirmed
source: HTTP / risk acknowledged
zh_cn: HTTP / 已确认风险

# EndpointSecurityLoopback
source: Local loopback
zh_cn: 本机回环
